In [26]:
import pandas as pd
import numpy as np

books = pd.read_parquet("Young Adult_books.parquet")
books.head(2)

,title,author,genres,page_count,publish_date,rating,num_ratings,num_reviews,five_stars,four_stars,three_stars,two_stars,one_star
0,The Hunger Games,Suzanne Collins,"[Young Adult, Dystopia, Fiction, Fantasy, Scie...",374,2008-09-14,4.34,9410653,241338,5134207,2861172,1055968,232135,127171
1,Catching Fire,Suzanne Collins,"[Young Adult, Fiction, Fantasy, Science Fictio...",391,2009-09-01,4.34,3910452,139213,2049041,1288295,465224,83691,24201

In [42]:
def book_df_info(books):
    no_title = len(books[books.title.isna()])
    print(f'Books with no title: {no_title}')

    no_author = len(books[books.author.isna()])
    print(f'Books with no author: {no_author}')

    genre_counts = books['genres'].apply(lambda x: len(x)).value_counts()
    print(f'\nGenre counts (by number of genres per book):\n{genre_counts}\n')

    no_ratings = len(books[(books.rating == 0) | (books.rating.isna())])
    print(f'Books with no rating: {no_ratings}')

    no_num_ratings = len(books[books.num_ratings == 0])
    print(f'Books with no number of ratings: {no_num_ratings}')

    no_num_reviews = len(books[books.num_reviews == 0])
    print(f'Books with no number of reviews: {no_num_reviews}')

    no_five_stars = len(books[books.five_stars == 0])
    print(f'Books with no 5-star ratings: {no_five_stars}')

    no_four_stars = len(books[books.four_stars == 0])
    print(f'Books with no 4-star ratings: {no_four_stars}')

    no_three_stars = len(books[books.three_stars == 0])
    print(f'Books with no 3-star ratings: {no_three_stars}')

    no_two_stars = len(books[books.two_stars == 0])
    print(f'Books with no 2-star ratings: {no_two_stars}')

    no_one_star = len(books[books.one_star == 0])
    print(f'Books with no 1-star ratings: {no_one_star}')

In [25]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         500 non-null    object
 1   author        500 non-null    object
 2   genres        500 non-null    object
 3   page_count    500 non-null    int64
 4   publish_date  500 non-null    datetime64[ns]
 5   rating        500 non-null    float64
 6   num_ratings   500 non-null    int64
 7   num_reviews   500 non-null    int64
 8   five_stars    500 non-null    int64
 9   four_stars    500 non-null    int64
 10  three_stars   500 non-null    int64
 11  two_stars     500 non-null    int64
 12  one_star      500 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(8), object(3)
memory usage: 50.9+ KB

In [3]:
for col in cols:
    print(f"Missing values in {col}: {sum(books[col].isna())}")

Missing values in title: 0
Missing values in author: 0
Missing values in genres: 0
Missing values in page_count: 0
Missing values in publish_date: 10
Missing values in rating: 0
Missing values in num_ratings: 0
Missing values in num_reviews: 0
Missing values in five_stars: 0
Missing values in four_stars: 0
Missing values in three_stars: 0
Missing values in two_stars: 0
Missing values in one_star: 0

In [4]:
reviews = pd.read_parquet("Science Fiction_reviews.parquet")
reviews

,title,user_id,rating
0,Dune,4686064-rajat-ubhaykar,5.0
1,Dune,17438949-melissa-dog-wolf-lover-martin,5.0
2,Dune,30181442-yun,2.0
3,Dune,5253785-lyn,5.0
4,Dune,1713956-manny,4.0
...,...,...,...
14995,"Life, the Universe and Everything",4596358-ferdy,3.0
14996,"Life, the Universe and Everything",60866073-baba,1.0
14997,"Life, the Universe and Everything",1145499-catsalive,5.0
14998,"Life, the Universe and Everything",84023-j-g-keely,5.0
14999,"Life, the Universe and Everything",6313408-jonathan-terrington,4.0

In [44]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   title    15000 non-null  object
 1   user_id  15000 non-null  object
 2   rating   14860 non-null  float64
dtypes: float64(1), object(2)
memory usage: 351.7+ KB